app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "genre", "pages", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)

    if @book.save